In [15]:
import os
import glob
import pandas as pd
#os.chdir("C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\unit_sales\\results\\")

In [16]:
extension = 'csv'
all_filenames = [i for i in glob.glob('*.{}'.format(extension))]

In [17]:
#combine all files in the list
combined_csv = pd.concat([pd.read_csv(f) for f in all_filenames ])
#export to csv
combined_csv.to_csv( "combined_csv.csv", index=False, encoding='utf-8-sig')

  order_purchase_date      product_category_name       price
0          2016-10-01  agro_industria_e_comercio  465.000000
1          2017-01-01  agro_industria_e_comercio  255.500000
2          2017-02-01  agro_industria_e_comercio  327.158000
3          2017-03-01  agro_industria_e_comercio  445.016667
4          2017-04-01  agro_industria_e_comercio  282.300000

In [74]:
df1 = pd.read_csv("C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\new_files\\monthly_product_category_input\\combined csv\\combined_csv.csv")
df2 = pd.read_csv("C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\new_files\\results\\combined\\combined_csv.csv")
df3 = pd.read_csv("C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\unit_sales\\input\\unit_sales_merged_monthly.csv")
df4 = pd.read_csv("C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\unit_sales\\results\\combined_csv.csv")

In [59]:
grouped_df1 = df1.groupby('order_purchase_date').agg({'price':'mean'})
grouped_df1.head()

                          price
order_purchase_date
2016-09-01            75.600000
2016-10-01           143.865923
2016-12-01           135.000000
2017-01-01           175.624661
2017-02-01           165.927409

In [76]:
grouped_df2 = grouped_df2.iloc[-12:,:]

In [77]:
grouped_df2 = df2.groupby('order_purchase_date').agg({'yhat':'mean'})
grouped_df2.head()
grouped_df2n.shape
grouped_df2n.to_csv('C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\new_files\\results\\combined\\trend2.csv')

In [78]:
grouped_df2n

                           yhat
order_purchase_date
2018-10-01           176.690438
2018-11-01           153.275365
2018-12-01           110.181991
2019-01-01           161.921901
2019-02-01           227.870355
2019-03-01           140.833053
2019-04-01           153.457660
2019-05-01           118.085909
2019-06-01           150.200258
2019-07-01           170.720603
2019-08-01           161.429116
2019-09-01           -82.694498

In [61]:
grouped_df3= df3.groupby(['order_purchase_date']).size().reset_index(name='Total Unit Sales')
grouped_df3.head()

  order_purchase_date  Total Unit Sales
0             2016-09                 3
1             2016-10                31
2             2016-12                 1
3             2017-01                43
4             2017-02                51

In [62]:
grouped_df4= df4.groupby(['order_purchase_date']).size().reset_index(name='Total Unit Sales')
grouped_df4.head()

  order_purchase_date  Total Unit Sales
0          2016-09-01                 6
1          2016-10-01                62
2          2016-12-01                 2
3          2017-01-01                86
4          2017-02-01               102

In [57]:
grouped_df1.shape
grouped_df1.to_csv('C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\new_files\\monthly_product_category_input\\combined csv\\trend.csv')

In [65]:
grouped_df3.shape
grouped_df3.to_csv('C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\unit_sales\\input\\trend3.csv',index=False)

In [67]:
grouped_df4n=grouped_df4.iloc[-12:,:]

In [68]:
grouped_df4n

   order_purchase_date  Total Unit Sales
24          2018-10-01               144
25          2018-11-01               144
26          2018-12-01               144
27          2019-01-01               144
28          2019-02-01               144
29          2019-03-01               144
30          2019-04-01               144
31          2019-05-01               140
32          2019-06-01               140
33          2019-07-01               136
34          2019-08-01               130
35          2019-09-01                 2

In [69]:
grouped_df4n.to_csv('C:\\Users\\Ajit Wagh\\Desktop\\TimeSeries\\new_categories\\unit_sales\\results\\combined\\trend4.csv',index=False)